package aGibon.ePrintF;

public class method {
    public static void main(String[] args) {
        //%d = 10진수
        //%o = 8진수
        //%x = 16진수
        //%c = 문자
        //%5d = 5자리 빈자리는 공백 처리
        //%-5d = 5자리 빈자리는 공백처리 왼쪽 정렬
        //%05d = 5자리 빈자리는 0

        //%s = 문자열
        //%5s = 5자리 빈자리는 공백
        //%-5s = 5자리 빈자리는 공백 왼쪽정렬

        //%f = 10진수 실수
        //%e = 지수
        //%4.1f = 4자리 소수점 이하 1자리
        //%04.1f = 4자리 소수점 이하 1자리 빈자리 0
        //%-4.1f = 4자리 소수점 이하 1자리 왼쪽정렬
    }
}
